Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བས་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གཞན་དག་ལ་ཚུལ་བཞིན་དུ་རྗོད་ཅིང་སྟོན་ཏེ། རབ་ཏུ་འཆད་ལ་རྣམ་པར་འབྱེད་དེ། གསལ་བར་བྱེད་ཅིང་། དེ་དག་གི་རོ་མྱོང་བའི་ཉེས་དམིགས་དང་། ངེས་པར་འབྱུང་བ་ཡང་སྟོན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “When great bodhisattva beings, their minds endowed with omniscience and preceded by great compassion, correctly describe and communicate these meditative concentrations, immeasurable aspirations, and formless absorptions to others, so that they might abandon afflicted mental states—expounding, analyzing, and elucidating them, and demonstrating the drawbacks of their experiences, as well as genuine emancipation—this is the transcendent perfection of generosity possessed by great bodhisattva beings.

source: གང་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་དེ་དག་གིས་བསམ་གཏན་དང་པོ་དེ་དང་། བསམ་གཏན་བཞི་པའི་བར་དུ་གནོན་ཅིང་སྒོམ་སྟེ། བསམ་གཏན་དེ་དག་ལ་གནས་ཤིང་སེམས་བསྐྱེད་པ་གཞན་འདི་ལྟ་སྟེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སེམས་དག་གི་སྐབས་མི་འབྱེད་པ་འདི་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནག་ནོག་མེད་པའོ། །
en: “When those who have cultivated a mind endowed with omniscience hone and cultivate the first meditative concentration and [the others], up to and including the fourth meditative concentration, and abide in these meditative concentrations without permitting the cultivation of other mindsets, that is to say, those of the śrāvakas and pratyekabuddhas—this, Śāradvatī­putra, is the unblemished transcendent perfection of ethical discipline possessed by great bodhisattva beings.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དེ་དག་དང་མ་བྲལ་བར་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་བསྟན་པར་བྱའོ་སྙམ་ནས། དེ་ཡིད་ལ་བྱེད་པ་དེ་དག་ལ་བཟོད་པ་དང་། འདོད་པ་དང་། ཉེ་བར་རྟོག་པ་དང་། ངེས་པར་སེམས་པ་གང་ཡིན་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Also, when any great bodhisattva beings, without being separated from the attention associated with omniscience, think, ‘I should teach the sacred doctrine to all sentient beings in order that they might abandon all afflicted mental states,’ and then exhibit endurance, satisfaction, investigation, and contemplation with respect to those attentions, this, Śāradvatī­putra, is the transcendent perfection of tolerance possessed by great bodhisattva beings.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་རང་གིས་བྱས་པའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས། རྟག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ལ། དེ་བརྩོན་པ་མི་གཏོང་ཞིང་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Also, when any great bodhisattva beings, through their attention endowed with omniscience, constantly dedicate all the roots of their virtuous actions for the sake of unsurpassed, genuinely perfect enlightenment, making common cause with all sentient beings, and then exhibit indefatigability and relentlessness, this, Śāradvatī­putra, is the transcendent perfection of perseverance possessed by great bodhisattva beings.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དག་ལ་སྙོམས་པར་འཇུག་ཅིང་ལྡང་ཡང་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་མི་ལྟུང་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དག་གིས་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་ཞུགས་པ་ན།
en: “Also, when any great bodhisattva beings, through their attention endowed with omniscience, become absorbed in the meditative concentrations, meditative stabilities, [formless] absorptions, and the [gateways to] liberation, and then arise [from those meditative states] without descending to the levels of the śrāvakas and pratyekabuddhas, this is the transcendent perfection of meditative concentration possessed by great bodhisattva beings.

source: བསམ་གཏན་གྱི་ཡན་ལག་ཐམས་ཅད་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་ཀྱང་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་ཟིན་པས་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པའམ།
en: “Also, when any great bodhisattva beings, through their attention endowed with omniscience, are absorbed in the meditative concentrations, the immeasurable aspirations, and the formless absorptions, they definitively discern that all the aspects of their meditative concentrations are facets of impermanence, modes of suffering, and aspects of emptiness, signlessness, and aspirationlessness, yet they enter neither into the maturity of the śrāvakas nor into the maturity of the pratyekabuddhas, because these [insights] are retained by great compassion.

source: རང་སངས་རྒྱས་ཀྱི་སྐྱོན་མེད་པ་ལ་ཡང་མི་འཇུག་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This, Śāradvatī­putra, is the transcendent perfection of wisdom possessed by great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ཡིན་ནོ། །
en: “These indeed, Śāradvatī­putra, represent the Great Vehicle of great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་དུ་དྲན་པ་ཉེ་བར་གཞག་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྒོམ་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་ཡང་དེ་བཞིན་ནོ། །རྣམ་པ་ཐམས་ཅད་དུ་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་སྒོམ་པ་དང་། རྣམ་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་སྒོམ་སྟེ།
en: “Moreover, Śāradvatī­putra, the same also applies when great bodhisattva beings definitively cultivate in all respects the four applications of mindfulness, and likewise [all the other causal attributes], up to and including the noble eightfold path, and when they cultivate in all respects the meditative stability of emptiness, the meditative stability of signlessness, and the meditative stability of aspirationlessness, and when they cultivate in all respects [all the other fruitional attributes], from the ten powers of the tathāgatas up to and including the eighteen distinct qualities of the buddhas.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ཡིན་ནོ། །
en: This, Śāradvatī­putra, is the Great Vehicle of great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སྙོམས་པར་འཇུག་ཅིང་། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པར་བྱའོ་ཞེས་དེ་དག་ལ་ཕན་པའི་སེམས་ཉིད་དུ་གཏོད་པར་བྱེད་དོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings are absorbed in loving kindness, they focus on the nature of mind that benefits sentient beings, thinking, ‘I should save all sentient beings!’

source: སྙིང་རྗེ་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་དེ་དག་ལ་སྙིང་བརྩེ་བའི་སེམས་ཉིད་དུ་གཏོད་པར་བྱེད་དོ། །དགའ་བ་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་འགྲོལ་བར་བྱའོ། །
en: Also, when they are absorbed in compassion, they focus on the nature of mind that directs compassion and love to all those beings, and when they are absorbed in empathetic joy, they also focus on all sentient beings, thinking, ‘I should liberate all sentient beings!’

source: ཞེས་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོད་པར་བྱེད་དོ། །བཏང་སྙོམས་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཟག་པ་ཟད་པར་གྱུར་ཅིག་ཅེས་སྒོམ་ཞིང་དེ་ཡང་དེ་དག་ལ་གཏོད་པར་བྱེད་པ་འདི་ནི།
en: Also, when they are absorbed in equanimity, they focus on those beings, meditating, ‘May all sentient beings achieve the cessation of contaminants!’

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་རྣམས་ལ་སྤྱོད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པ་དེ་དག་ཉིད་ཀྱི་རྣམ་པ་དང་།
en: This, Śāradvatī­putra, is the transcendent perfection of generosity, possessed by great bodhisattva beings who practice the four immeasurable aspirations.

source: རྟགས་དང་མཚན་མ་དག་གིས་སྙོམས་པར་འཇུག་ཅིང་ལྡང་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་གཏོགས་པར་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པ་དག་ལ་སྤྱོད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དག་གིས་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་དང་མ་འདྲེས་པར་གནས་ཏེ། ས་གཉིས་པོ་དེ་དག་དང་། ཉན་ཐོས་ཀྱི་སའམ།
en: “Also, when any great bodhisattva beings become absorbed in the aspects of those meditative concentrations, immeasurable aspirations, and formless absorptions, replete with the [appropriat‌e] signs and indications [of success in practice], and then arise [from those meditative states], without dedicating their merit to the level of the śrāvakas or the level of the pratyekabuddhas, and instead only dedicating it to omniscience, this is the transcendent perfection of ethical discipline, possessed by great bodhisattva beings who practice the meditative concentrations, the immeasurable aspirations, and the formless absorptions.

source: རང་སངས་རྒྱས་ཀྱིས་ལ་འདོད་པ་མི་སྐྱེད་ཀྱི། དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བཟོད་པ་དང་། འདོད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པ་དག་ལ་སྤྱོད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “When great bodhisattva beings, through their attention endowed with omniscience, abide in the meditative concentrations, the immeasurable aspirations, and the formless absorptions, without confusing them, and do not desire those two levels—the level of the śrāvakas or the level of the pratyekabuddhas—but accept and desire only omniscience, this is the transcendent perfection of tolerance, possessed by great bodhisattva beings who practice the meditative concentrations, the immeasurable aspirations, and the formless absorptions.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དག་གིས་མི་དགེ་བའི་ཆོས་སྤང་བ་དང་། དགེ་བའི་ཆོས་བསྒྲུབ་པའི་ཕྱིར་བརྩོན་པ་མི་གཏོང་བར་གནས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པ་དག་ལ་གནས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསམ་གཏན་དེ་དག་ཉིད་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་ཉིད་ལ་སྙོམས་པར་འཇུག་ཅིང་ལྡང་ཡང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་།
en: “Also, when any great bodhisattva beings, through their attention endowed with omniscience, maintain their indefatigability and relentlessness in order to abandon non-virtuous actions and adopt virtuous actions, this is the transcendent perfection of perseverance, possessed by great bodhisattva beings who abide in the meditative concentrations, the immeasurable aspirations and the formless absorptions.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གིས་མི་འཕྲོགས་ལ། དེ་དག་གི་དབང་གིས་ཀྱང་མི་སྐྱེ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དག་ལ་གནས་པའི་ཐབས་ལ་མཁས་པ་ལས་བྱུང་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བདག་གིས་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྙོམས་པར་འཇུག་པ་དེ་དག་ལ་སྙོམས་པར་ཡང་འཇུག་ཅིང་ལྡང་ཡང་དེ་དག་ཀྱང་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: “Also, when any great bodhisattva beings become absorbed in those meditative concentrations, immeasurable aspirations, and formless absorptions, and then arise [from those meditative states], but are not captivated by those meditative concentrations, immeasurable aspirations, and formless absorptions, and are not subject to rebirth on account of them, this is the transcendent perfection of meditative concentration, originating from the skillful means of great bodhisattva beings who abide in the meditative concentrations, the immeasurable aspirations, and the formless absorptions.

source: སྨོན་པ་མེད་པའི་རྣམ་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་ཀྱང་དེ་དག་གིས་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པའམ། རང་སངས་རྒྱས་ཀྱི་སྐྱོན་མེད་པར་ཡང་མི་འཇུག་པ་འདི་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དག་ལ་སྤྱོད་པའི་ཐབས་ལ་མཁས་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: “Also, when any great bodhisattva beings, through their attention endowed with omniscience, are absorbed in the meditative stabilities of the meditative concentrations, the immeasurable aspirations, and the formless absorptions, and then arise [from those states], but definitively discern that all of those are facets of impermanence, modes of suffering, aspects of selflessness, and aspects of emptiness, signlessness, and aspirationlessness, without entering either into the maturity of the śrāvakas or into the maturity of the pratyekabuddhas, this, Śāradvatī­putra, is the transcendent perfection of wisdom, originating from the skillful means of great bodhisattva beings who practice the meditative concentrations, the immeasurable aspirations, and the formless absorptions.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལས་བྱུང་བའི་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་ཟིན་པའི་ཐེག་པ་ཆེན་པོ་ཡིན་ནོ། །
en: “Śāradvatī­putra, these six transcendent perfections of great bodhisattva beings are the Great Vehicle that is retained by skillful means originating from the meditative concentrations, the immeasurable aspirations and the formless absorptions.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། མི་དམིགས་པའི་ཚུལ་གྱིས་ནང་སྟོང་པ་ཉིད་ཤེས་པའོ། །
en: “Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings understands the emptiness of internal phenomena without apprehending anything.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། མི་དམིགས་པའི་ཚུལ་གྱིས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཤེས་པ་ཡང་དེ་བཞིན་ནོ། །
en: Likewise, in the same vein, it also understands [all the other aspects of emptiness], up to and including the emptiness of the essential nature of non-entities, without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་གཡེངས་སོ་སྙམ་པ་དང་མཉམ་པར་གཞག་པའོ་སྙམ་དུ་ཤེས་པ་མི་འཇུག་པ་གང་ཡིན་པའོ། །
en: “Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings does not cause one to know that ‘all things are distraction’ or ‘this is meditative absorption.’

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་རྟག་གོ་སྙམ་པ་དང་། མི་རྟག་གོ་སྙམ་དུ་ཤེས་པ་མི་འཇུག་པ་གང་ཡིན་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings does not cause one to know that ‘this is permanent’ or ‘this is impermanent.’

source: བདེའོ་སྙམ་པ་དང་། སྡུག་བསྔལ་ལོ་སྙམ་པ་དང་། བདག་ཡོད་དོ་སྙམ་པ་དང་། བདག་མེད་དོ་སྙམ་དུ་ཤེས་པ་མི་འཇུག་པ་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ།། །༄༅༅། །
en: Similarly, in the same vein, it does not cause one to know that ‘this is imbued with happiness,’ ‘this is imbued with suffering,’ this is a self,’ or ‘this is not a self,’ and it does so without apprehending anything.

source: འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ། བམ་པོ་དགུ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདས་པའི་དུས་ལ་ཤེས་པ་མི་འཇུག །
en: “Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings does not cause one to know past time.

source: མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་ལ་ཤེས་པ་མི་འཇུག་ལ། དུས་གསུམ་པོ་དག་མི་ཤེས་པ་ཡང་མ་ཡིན་པ་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །
en: It does not cause one to know future time and present time—nor does it not cause one to know the three times, but it does so without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདོད་པའི་ཁམས་སུ་ཤེས་པ་མི་འཇུག །
en: “Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings does not cause one to know the world system of desire.

source: གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་སུ་ཤེས་པ་མི་འཇུག་ལ། ཁམས་གསུམ་ལ་མི་ཤེས་པ་ཡང་མི་འཇུག་པ་གང་ཡིན་པ་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་སོ། །
en: It does not cause one to know the world system of form and the world system of formlessness—nor does it not cause one to know the three world systems, but it does so without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འཇིག་རྟེན་པའི་ཆོས་རྣམས་ལ་ཤེས་པ་མི་འཇུག །འཇིག་རྟེན་ལས་འདས་པ་རྣམས་དང་། འདུས་བྱས་རྣམས་དང་། འདུས་མ་བྱས་རྣམས་དང་། ཟག་པ་དང་བཅས་པ་རྣམས་དང་། ཟག་པ་མེད་པའི་ཆོས་རྣམས་ལ་མི་ཤེས་པ་མི་འཇུག་ལ། འཇིག་རྟེན་པའི་ཆོས་རྣམས་ལ་མི་ཤེས་པ་ཡང་མི་འཇུག །
en: “Moreover, Śāradvatī­putra, the Great Vehicle of great bodhisattva beings does not cause one to know mundane phenomena.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་དང་། འདུས་བྱས་རྣམས་དང་། འདུས་མ་བྱས་རྣམས་དང་། ཟག་པ་དང་བཅས་པ་རྣམས་དང་། ཟག་པ་མེད་པའི་ཆོས་རྣམས་ལ་མི་ཤེས་པ་ཡང་མི་འཇུག་ཅིང་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་མི་འཇུག་པ་སྟེ།
en: It does not cause one to know supramundane, conditioned, unconditioned, contaminated, and uncontaminated phenomena—nor does it not cause one to know mundane phenomena, and nor does it not cause one to know supramundane, conditioned, unconditioned, contaminated, and uncontaminated phenomena, but it does so without apprehending anything.”

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་གནས་ན། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པའི་ཐེག་པ་ཡིན་ཏེ།
en: “Śāradvatī­putra, that on which great bodhisattva beings abide is the [Great] Vehicle that enters into the maturity of the bodhisattvas.

source: ཉི་ཚེ་བའི་ཐེག་པ་འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ངེས་པར་འབྱུང་བ་མ་ཡིན་པ་ཡིན་ནོ། །
en: This is not the emancipation associated with limited vehicles, that is to say, with the vehicle of the śrāvakas or the vehicle of the pratyekabuddhas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། གོ་ཆ་ཆེན་པོ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: If you ask why, it is because the Great Vehicle and the great armor are not distinct from one another.

source: གོ་ཆ་ཆེན་པོ་ཉིད་ཐེག་པ་ཆེན་པོ་ཡིན་ལ། ཐེག་པ་ཆེན་པོ་ཉིད་ཀྱང་གོ་ཆ་ཆེན་པོ་ཡིན་པའི་ཕྱིར་ཏེ། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་།
en: The great armor itself is the Great Vehicle, and the Great Vehicle itself is the great armor.

source: གོ་ཆ་ཆེན་པོ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཡིན་ནོ། །
en: It is the Great Vehicle and the great armor that constitute the maturity of the bodhisattvas.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པ་ཞེས་བརྗོད་པར་བགྱི་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: To what extent is it said of great bodhisattva beings that they abide in the Great Vehicle?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་གནས་ནས་མི་དམིགས་པའི་ཚུལ་གྱིས་སྦྱིན་པ་ཡང་མི་དམིགས། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ལེན་པ་ཡང་མི་དམིགས་པ་དང་།
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of generosity, they abide in the transcendent perfection of wisdom, and because they act without apprehending anything, they do not apprehend gifts, they do not apprehend their transcendent perfection of generosity, nor do they apprehend recipients.

source: དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་གནས་ནས་མི་དམིགས་པའི་ཚུལ་གྱིས་དགེ་བའི་ཆོས་མི་དམིགས། མི་དགེ་བའི་ཆོས་དང་། ལུང་དུ་བསྟན་པ་དང་། ལུང་དུ་མ་བསྟན་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་།
en: Similarly, when they practice the transcendent perfection of ethical discipline, the transcendent perfection of tolerance, the transcendent perfection of perseverance, the transcendent perfection of meditative concentration, and the transcendent perfection of wisdom, they abide in the transcendent perfection of wisdom [and so forth], and because they act without apprehending anything, they do not apprehend virtuous phenomena, nor do they apprehend non-virtuous, determinate, indeterminate, mundane, supramundane, conditioned, unconditioned, contaminated, or uncontaminated phenomena.

source: ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པའི་ཆོས་རྣམས་མི་དམིགས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒོམ་པ་པོ་མི་དམིགས་པ་སྟེ།
en: They do not apprehend the transcendent perfection of wisdom, the cultivation of the transcendent perfection of wisdom, or the cultivators of the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པ་ཞེས་བྱའོ། །
en: Śāradvatī­putra, it is to that extent that great bodhisattva beings are said to abide in the Great Vehicle.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མ་འདྲེས་པས་བསྒོམ་པ་རྣམ་པར་གཞིག་པའི་ཆེད་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྒོམ་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བསྒོམ་མོ། །དེ་བཞིན་དུ་བསྒོམ་པ་རྣམ་པར་གཞིག་པའི་ཆེད་དུ་ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་།
en: “Moreover, Śāradvatī­putra, great bodhisattva beings, their unconfused minds endowed with omniscience, should cultivate the four applications of mindfulness in order to terminate this cultivation, and they do so without apprehending anything.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་བསྒོམ་སྟེ།
en: Similarly, they should cultivate the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the three gateways to liberation, the ten powers of the tathāgatas, and so on, up to and including the eighteen distinct qualities of the buddhas, all in order to put an end to cultivation, and they do so without apprehending anything.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བསྒོམ་མོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་བསྒོམ་པ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པ་ཞེས་བྱའོ། །
en: Śāradvatī­putra, great bodhisattva beings who undertake cultivation accordingly are said to abide in the Great Vehicle.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་པ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ་ཞེས་བྱ་བར་ཤེས་སོ། །
en: “Moreover, Śāradvatī­putra, owing to the non-apprehension of sentient beings, great bodhisattva beings understand that a so-called ‘bodhisattva’ is a mere name or conventional term.

source: དེ་བཞིན་དུ་འདི་ལྟ་སྟེ། གཟུགས་ཞེས་བྱ་བ་འདི་ནི་མིང་ཙམ་དུ་ཟད་དོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་ཀྱང་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དེ་བཞིན་ནོ། །
en: Similarly, it follows that so-called ‘physical forms’ are nothing but a mere designation, and the same goes for feelings, perceptions, and formative predispositions because they too are non-apprehensible.

source: རྣམ་པར་ཤེས་པ་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་འདི་ལྟ་སྟེ། རྣམ་པར་ཤེས་པ་འདི་ནི་མིང་དང་ཐ་སྙད་ཙམ་དུ་ཟད་དོ། །
en: Also, since consciousness is non-apprehensible, it follows that so-called ‘consciousness’ is nothing but a mere name or conventional term.
